# TAGS: [user_messages]
# ----- MENU BUTTONS CONSTANTS -----

BTN_MENU = "Главное меню"
BTN_FEEDBACK = "Обратная связь"



BOT_FOR_APPLICANTS_USERNAME="MeetYourManagerBot"



INSTRUCTIONS_TO_SHOOT_VIDEO_TEXT = (
    "📹 Запишите прямо в телеграме или загрузите КОРОТКОЕ приветственное видео (не более 60 секунд).\n" 
    " - Представьтесь, \n"
    " - Расскажите 3-4 фразы о ключевом опыте под эту роль и что вы можете принести компании.\n"
    " - Говорите чётко, при хорошем свете, смотрите в камеру и улыбайтесь 😊\n"
    " — Менеджеру важнее увидеть живого человека, а не идеально отреперированную речь.\n"
    " - Не переживайте о техническом качестве, главное - это вы и ваша мотивация."
    "--------------------------------"
    "Вы можете делать сколько угодно дублей. Я ничего не отправлю без вашего финального подтверждения."
)

VIDEO_SENDING_CONFIRMATION_TEXT = "Готовы отправить это видео кандидатам или хотите записать другое?"


# ----- DATA SERVICE CONSTANTS -----

DATA_DIR = "users_data"
APPLICANT_BOT_DATA_DIR = "applicant_bot_data"
APPLICANT_BOT_RECORDS_FILENAME = "applicant_bot_records"


# ----- AI SERVICE CONSTANTS -----

# ----- VIDEO SERVICE CONSTANTS -----

MAX_DURATION_SECS = 90


# ****** CONSTANTS with TAGS: [user_messages] ******

WELCOME_TEXT_WHEN_STARTING_BOT = "Добро пожаловать в бот, где вы сможете посмотреть приветсвенное видео менеджера."

WELCOME_VIDEO_RECORD_REQUEST_TEXT = "Хотите записать короткое видеовизитку для нанимающего менеджера?\nЭто поможет выделиться на фоне других кандидатов и ускорить процесс выхода на интервью.\nМы подскажем, как это сделать."
WAITING_FOR_ANOTHER_VIDEO_TEXT = "Хорошо, кидайте другое видео в чат.\nЯ попрошу подтверждения перед отправкой кандидатам."
CONTINUE_WITHIOUT_APPLICANT_VIDEO_TEXT = (
    "Видеовизитки помогают менеджерам быстрее оценить кандидата и скорость выхода на интервью увеличивается в разы.\n"
    "На вакансию уже есть кандидаты с видеовизитками и без видео с ними будет непросто конкурировать.\n"
    "Если вы захотите записать видеовизитку, вы можете вернуться к этому этапу командой нажав кнопку 'Главное меню'.\n"
    "Желаем вам удачи в поиске. Вы сильный кандидат и у вас все получится! 💪"
)

PRIVACY_POLICY_LINK_APPLICANT = "https://hrvibe.ru/policy-personal-data"
PRIVACY_POLICY_PROCESSING_CONFIRMATION_LINK_APPLICANT = "https://hrvibe.ru/confirmation-personal-data-processing"

PRIVACY_POLICY_CONFIRMATION_TEXT_APPLICANT = (
    f"Для продолжения работы с ботом:\n"
    f"- ознакомьтесь с <a href=\"{PRIVACY_POLICY_LINK_APPLICANT}\">политикой обработки персональных данных</a>\n" 
    f"- подтвердите <a href=\"{PRIVACY_POLICY_PROCESSING_CONFIRMATION_LINK_APPLICANT}\">согласие на обработку персональных данных и видео</a>\n"
)



# ----- USER MESSAGES CONSTANTS with SUCCESS status-----

SUCCESS_TO_GET_PRIVACY_POLICY_CONFIRMATION_TEXT = "Согласие на обработку персональных данных получено, можем продолжить работу."
SUCCESS_TO_GET_WELCOME_VIDEO_TEXT = "Вы ужу посмотрели приветственное видео от менеджера."
SUCCESS_TO_SAVE_VIDEO_TEXT = (
    "=Ваша видео-визитка успешно сохранена.\n"
    "Мы покажем ее менеджеру и если вас приглясят на интервью мы вас уведомим.\n"
    "Спасибо за ваше время! Вы сильный кандидат и у вас все получится! 💪"
)

# ----- USER MESSAGES CONSTANTS with FAIL status-----

FAIL_TECHNICAL_SUPPORT_TEXT = "Произошла ошибка. Тех. поддержка уже спешит на помощь."


# ----- USER MESSAGES CONSTANTS with MISSING DATA status-----

MISSING_PRIVACY_POLICY_CONFIRMATION_TEXT = "Чтобы продолжить работу нам необходимо ваше согласие на обработку персональных данных.\nВы можете это сделать, нажав кнопку 'Главное меню'."
MISSING_VIDEO_RECORD_TEXT = "Нет видео для сохранения. Пришлите заново, пожалуйста."

# ----- FEEDBACK CONSTANTS -----

FEEDBACK_REQUEST_TEXT = "Напишите ваш вопрос или обратную связь в чате и я направлю ее админу."
FEEDBACK_SENT_TEXT = "Ваше сообщение отправлено администратору. Спасибо за обратную связь!"
FEEDBACK_ONLY_TEXT_ALLOWED_TEXT = "Пожалуйста, отправьте только текстовое сообщение. Видео, аудио и изображения пока не принимаются."
FAIL_TO_IDENTIFY_PAYLOAD_TEXT = "Извините. Не удалось определить по какой вакансии и резюме вы пришли."

INFO_ABOUT_VIDEO_DELETION_TEXT = "Если в какой-то момент вы захотите удалить вашу видео визитку. Напишите об этом в тех поддержку, нажав кнопку 'Обратная связь'."